Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh127-v3.tmx
Source language: bo
Languages: en

source: །སངས་རྒྱས་ཞིང་ནི་བྱེ་བ་མང་པོ་ན།
en: “One may be able to count out, with the tip of the hundredth part of a hair,

source: །ཆུ་ཡི་ཕུང་པོ་རྟག་འདུག་ཅི་ཡོད་པ།
en: The masses of water ever present

source: །བརྒྱ་ཚལ་སྐྲ་ཡི་རྩེ་མོས་བགྲང་ནུས་ཀྱང་།
en: In many millions of buddha realms,

source: །དེ་ཡི་དབྱངས་ཀྱི་ཡན་ལག་ཀུན་མི་འགྲངས།
en: But one cannot count the different aspects of their speech. {23} “One may be able to count after many millions of eons

source: །གང་སྔོན་འདིར་ནི་སེམས་ཅན་ཅི་འབྱུང་བ།
en: All the beings who have appeared in the past

source: །རང་གི་ལུས་ལ་སྙིང་པོར་འདོགས་པ་རྣམས། །བསྐལ་པ་བྱེ་བ་མང་པོས་བགྲང་ནུས་ཀྱང་། །དེ་དག་མདོ་སྡེ་སྒྲུབ་པ་ཤེས་མི་ནུས།
en: Who have cherished their own bodies, But one cannot know the extent of the sūtras they have accomplished. {24} “It may be possible to count all the sounds made by all creatures,

source: །ཕྱོགས་བཅུ་དག་ན་སེམས་ཅན་ཅི་ཡོད་པ། །སྲོག་ཆགས་ཀུན་གྱི་སྒྲ་སྐད་བགྲང་ནུས་ཀྱང་། །དེ་དག་རྟག་ཏུ་མི་འཆད་སྟོན་པ་ཡི།
en: By all beings who are living in the ten directions,

source: །མདོ་སྡེ་དེ་དག་བགྲང་བར་ཡོང་མི་ནུས།
en: But one cannot count the number of sūtras That are uninterruptedly taught by them. {25}

source: །ཆོས་རྣམས་ཐམས་ཅད་བསྟན་པར་རབ་ཤེས་ཤིང་།
en: “They know how to teach the entire Dharma.

source: །ངེས་པའི་ཚིག་དང་བསྟན་པ་ཚིག་དོན་མཁས།
en: They are skilled in etymologies, teaching, and the meaning of words.

source: །གཏན་ལ་བབ་པའི་ཡང་དག་ཚུལ་ལ་བསླབས།
en: They have trained in the way of definitive knowledge,

source: །བློ་གྲོས་ཡངས་ཤིང་རྟག་དགའ་ཤེས་རབ་ཅན།
en: Have vast understanding, and constantly have joyful wisdom. {26}

source: །ཡངས་པའི་དོན་སེམས་རབ་ཏུ་ཕྱེ་བའི་བློ།
en: “They have analytic comprehension, cognize vast meaning,

source: །བསམ་དང་མི་བསམ་པ་ཡང་རྟག་ཏུ་ཤེས།
en: And they always know the conceivable and inconceivable.

source: །དབྱངས་ཀྱི་རང་བཞིན་རྒྱ་ཆེན་ཐམས་ཅད་རིག །སྒྲ་དབྱངས་དེ་དག་སྟོན་ཀྱང་ཆགས་མི་འགྱུར།
en: They know all the languages spoken on the earth And with those words teach without attachment to them. {27}

source: །ཐོགས་མེད་དེ་ནི་ཆོས་སྨྲར་བརྗོད་པ་སྟེ།
en: “The dharmabhāṇakas teach unobstructedly.

source: །འགྲོ་བ་ཀུན་ལ་སྟོན་ཀྱང་ཆགས་མི་འགྱུར།
en: They teach all beings without attachment.

source: །དྲི་བ་ངེས་པར་བསྟན་པ་བརྒྱ་ལ་མཁས།
en: They are skilled in the words of answering questions,

source: །དེ་ལྟར་དེ་ཡིས་དོན་དམ་རབ་ཏུ་རྟོགས།
en: And thus they know the ultimate truth. {28} “Without attachment they teach

source: །མདོ་སྡེ་གཅིག་གིས་ཕྱོགས་ཀྱང་བྱེ་བ་སྙེད།
en: Countless millions of teachings from within one sūtra.

source: །བསམ་གྱིས་མི་ཁྱབ་དེས་སྟོན་ཆགས་པ་མེད། །ཆགས་མེད་སྟོན་པ་ཚིག་གི་དོན་ལ་མཁས།
en: Without attachment they are skilled in teaching and the meaning of words;

source: །འཁོར་གྱི་ནང་དུ་དེ་འཆད་ཆགས་མི་འགྱུར།
en: Without attachment they teach in the middle of the assembly. {29}

source: །ཏིང་འཛིན་འདི་ལ་ལེགས་པར་གང་གནས་པ།
en: “The ones who are established in this samādhi

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་གཡོ་བ་མེད།
en: Have become unshakable bodhisattvas.

source: །ཆོས་ལ་སྟོབས་བསྐྱེད་བྱེ་བྲག་ཐོབ་པས་ནི།
en: They have attained unique strength in the Dharma

source: །སྲོག་ཆགས་བྱེ་བ་མང་པོའི་དོན་དེ་བྱེད།
en: So that they can benefit many millions of beings. {30}

source: །ཇི་ལྟར་རི་རབ་མི་གཡོ་མི་འགུལ་ཏེ།
en: “Just as Sumeru, unshakable and immovable,

source: །རླུང་རྣམས་ཀུན་གྱིས་འགུལ་བར་མི་ནུས་པ།
en: Cannot be shaken by the winds,

source: །དེ་བཞིན་དགེ་སློང་ཆོས་སྨྲ་མཁས་པ་ཡང་།
en: In that way the dharmabhāṇaka bhikṣus

source: །ཕ་རོལ་རྒོལ་བ་ཀུན་གྱིས་བསྐྱོད་མི་ནུས། །སྟོང་ཆེན་གྱི་ནི་འཇིག་རྟེན་ཁམས་འདི་ན། །རི་གང་མི་གཡོ་བར་ནི་བརྗོད་པ་རྣམས། །དེ་དག་རླུང་གིས་རབ་ཏུ་བསྐྱོད་ནུས་ཀྱང་།
en: Cannot be shaken by any opponent. {31} “It may be possible for the winds to shake Those mountains declared to be unshakable In the worlds of this billion-world universe,

source: །སྟོང་པའི་ཆོས་གནས་དགེ་སློང་བསྐྱོད་མི་ནུས།
en: But the bhikṣus dwelling in emptiness cannot be shaken. {32}

source: །སུ་དག་སྟོང་པ་ཉིད་ལ་རྟག་བརྩོན་པ།
en: “The ones who are constantly engaged with emptiness

source: །སངས་རྒྱས་གནས་སུ་ངེས་པ་དེ་ཡིན་ཏེ།
en: Are those who certainly dwell with the buddhas.

source: །གཏན་ལ་བབ་པ་སྟོང་པའི་ཆོས་རབ་ཤེས།
en: They know with certainty the emptiness of phenomena

source: །དེ་ནི་རྒོལ་བ་ཀུན་གྱིས་དཀྲུག་མི་ནུས།
en: And cannot be swayed by any opponent. {33}

source: །ཕས་ཀྱི་རྒོལ་བ་དག་གིས་མི་བསྐྱོད་ཅིང་།
en: “They cannot be shaken by any opponent,

source: །སྨྲ་བ་ཐམས་ཅད་ཀྱིས་ཀྱང་ཟིལ་མི་ནོན།
en: And they cannot be overcome by any opponent.

source: །ཏིང་འཛིན་ཞི་བ་འདི་ནི་བསྟན་བྱས་ན།
en: They teach this peace, this samādhi,

source: །ཟིལ་གྱིས་མི་ནོན་སྨད་པ་མེད་པར་འགྱུར།
en: And are invincible and irreproachable. {34}

source: །ཏིང་འཛིན་ཞི་བ་འདི་ནི་བཤད་བྱས་ན།
en: “Having taught this peace, this samādhi,

source: །དེ་ཡིས་སྟོང་ཉིད་རྟོགས་པར་ཁོང་དུ་ཆུད།
en: They have the realization of emptiness

source: །དེ་ནི་ཆོས་རྣམས་ཀུན་ལ་ནེམ་ནུར་མེད།
en: And they have no doubt in any of the Dharma,

source: །ཡེ་ཤེས་མཐའ་ཡས་དག་ལ་ཁོར་མོར་གནས། །ཏིང་འཛིན་འདི་ནི་བཟུང་ཞིང་བཀླགས་པ་ན། །སྟོབས་དང་བྱང་ཆུབ་ཡན་ལག་རྙེད་མི་དཀའ།
en: And continuously remain in endless wisdom. {35} “Attaining the strengths and the aspects of enlightenment Is not difficult for those who have obtained and recited this samādhi. It is not difficult to attain the inconceivable

source: །ཡང་དག་རིག་དང་རྫུ་འཕྲུལ་བསམ་མི་ཁྱབ། །དེ་ལ་མངོན་པར་ཤེས་པ་རྙེད་མི་དཀའ།
en: Discernments, miracles, and higher cognitions. {36}

source: །མཐའ་ཡས་ཡེ་ཤེས་རྒྱལ་བ་མཐོང་བ་ཡང་།
en: “Within created existences, with infinite wisdom

source: །སྲིད་པར་གྲུབ་པ་དག་ནི་རྙེད་མི་དཀའ།
en: It is not difficult for them to see the jinas. The ones who possess this samādhi will see

source: །སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་མི་ཁྱབ།
en: Countless quintillions of buddhas. {37}

source: །ཏིང་འཛིན་འདི་འཆང་དེ་ཡིས་མཐོང་བར་འགྱུར། །དེ་ནི་རྒྱལ་བ་དེ་དག་ཐམས་ཅད་ལས། །ཏིང་འཛིན་ཞི་བ་འདི་ཡང་ཐོས་འགྱུར་ཏེ།
en: “They will hear this peace, this samādhi, Directly from all of those jinas.

source: །སངས་རྒྱས་ཡེ་ཤེས་མཆོག་དང་ལྡན་པར་འགྱུར། །སྟོང་ཆེན་གྱི་ནི་འཇིག་རྟེན་ཁམས་འདི་དག །ལྷ་རྫས་ནོར་བུ་རིན་ཆེན་བཟང་མཆོག་གིས།
en: And will possess the supreme wisdom of the buddhas. {38} “If all the worlds in the billion-world universe Were to be filled with precious jewels, With the wealth of divine, supreme precious jewels

source: །འོག་ནས་བཟུང་སྟེ་སྲིད་པའི་རྩེ་མོའི་བར།
en: From the depths to the summit of existence, {39}

source: །ནོར་བུ་རིན་ཆེན་དག་གིས་གང་གྱུར་དང་། །ཞིང་ཡང་མཐའ་ཡས་རྣམ་མང་ཇི་སྙེད་པ།
en: “And if all of the various, infinite realms

source: །འཛམ་བུའི་ཆུ་བོའི་གསེར་བཀྲམ་གང་བ་ཀུན།
en: Were covered with gold from the Jambu River

source: །ས་ཡི་འོག་ནས་སྲིད་པའི་རྩེ་མོའི་བར།
en: From the depths to the summit of existence,

source: །ཐམས་ཅད་རྒྱལ་བའི་མཆོག་ལ་སྦྱིན་པ་བྱིན།
en: And all of it were given as an offering to the jinas, {40}

source: །སེམས་ཅན་རྣམ་པ་མང་པོ་ཇི་སྙེད་པ།
en: “And if all of the various beings there are

source: །བསྐལ་པ་མཐའ་ཡས་མང་པོར་སྦྱིན་པ་བྱིན།
en: Made this offering to them for endless eons,

source: །སངས་རྒྱས་རྣམས་ལ་ཁོར་མོར་མི་ཆད་བྱིན།
en: Making this gift, giving constantly to the buddhas

source: །བྱང་ཆུབ་འདོད་ཕྱིར་བྱིན་པའི་སྦྱིན་ཚོགས་ལ།
en: And creating this accumulation of generosity for the sake of enlightenment, {41}

source: །དགེ་སློང་གང་དག་སྟོང་ཉིད་མངོན་དགའ་ཞིང་། །སྟོབས་བཅུ་ལ་ནི་ཐལ་སྦྱར་ཕྱག་འཚལ་ན།
en: “And if there were a bhikṣu who rejoiced in emptiness And with hands together paid homage to those with the ten strengths, Then the former accumulation of generosity would not even be a fraction

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཉིད་མངོན་དགའ་ལ།
en: Of that of the bodhisattva who rejoiced in emptiness. {42}

source: །སྦྱིན་པའི་ཕུང་པོ་སྔ་མས་ཆར་མི་འཕོད།
en: “The supreme being has given the example

source: །བསོད་ནམས་ལྡན་པའི་མི་དེས་དེ་རྙེད་ནས།
en: Of a person with merit who has that attainment, Develops vast faith, and performs acts of generosity

source: །སངས་རྒྱས་བྱང་ཆུབ་མཚུངས་མེད་ཚོལ་བའི་ཕྱིར།
en: In seeking the unequaled enlightenment of buddhahood. {43} “All that generosity cannot be even a hundredth

source: །དད་པ་རྒྱ་ཆེར་བསྐྱེད་ནས་སྦྱིན་པ་བྱིན།
en: Of the accumulation of merit that is acquired

source: །དེ་ཡི་དཔེ་འདི་སྐྱེས་བུ་དམ་པས་བསྟན།
en: By someone who with a pleased mind obtains

source: །སུ་དག་ཏིང་འཛིན་དམ་པའི་མཆོག་འདི་ལས། །ཚིག་བཞིའི་ཚིགས་བཅད་སེམས་དགའ་འཛིན་པ་ཡང་། །དེ་ཡི་བསོད་ནམས་ཕུང་པོ་བསགས་པ་ལ།
en: One four-line verse of this supreme excellent samādhi. {44}

source: །སྦྱིན་པ་དེ་ཀུན་བརྒྱ་ཡི་ཆར་མི་ཕོད།
en: “Bodhisattvas who, wishing to benefit, practice generosity,

source: །ཏིང་འཛིན་རྡུལ་བྲལ་ཞི་བ་མ་ཐོས་པར། །ཕན་བྱེད་བྱང་ཆུབ་སེམས་དཔས་སྦྱིན་བྱིན་ཀྱང་།
en: But who have not heard this peace, this stainless samādhi,

source: །ཐོས་པས་སངས་རྒྱས་ཡེ་ཤེས་མྱུར་ཐོབ་ལྟར། །དེ་ཙམ་སངས་རྒྱས་ཡེ་ཤེས་མྱུར་མི་འཐོབ།
en: Will not quickly attain the wisdom of buddhahood; But having heard it they will quickly attain the wisdom of buddhahood. {45} “Bodhisattvas who rejoice in this lineage

source: །གང་གིས་ཞིང་མཆོག་ས་འདི་ཐོབ་ནས་སུ། །རྡུལ་བྲལ་ཏིང་འཛིན་སྟོང་པའི་རིགས་འདི་ནི།
en: Of those who, having attained this level of supreme peace,

source: །བྱང་ཆུབ་སེམས་དཔའ་དགའ་བས་རྟོགས་བྱེད་པ།
en: Have heard the stainless samādhi, will gain understanding

source: །དེས་ནི་སངས་རྒྱས་ཡེ་ཤེས་མྱུར་དུ་འཐོབ། །གང་གིས་འདི་ལྟ་བུ་ཡི་གཏེར་རྙེད་པ།
en: And will quickly attain the wisdom of buddhahood. {46} “They have obtained such a treasure as infinite realms

source: །ཞིང་རྣམས་མཐའ་ཡས་གང་གཱའི་བྱེ་མ་སྙེད།
en: That are as numerous as the Ganges sands,

source: །དེ་དག་ལྷ་དང་དེ་བཞིན་མི་རྣམས་ཀྱི། །ནོར་བུ་རིན་པོ་ཆེ་ཡིས་གང་བར་གྱུར།
en: Filled with precious jewels Both human and divine. {47}

source: །བྱང་ཆུབ་སེམས་དཔས་ཏིང་འཛིན་འདི་ཐོབ་སྟེ།
en: “Bodhisattvas who obtain this samādhi

source: །རྟག་ཏུ་ཆུབ་པར་བྱེད་ཅིང་མི་ངོམས་པ།
en: And who always insatiably study it

source: །ཐུལ་བར་དཀའ་ཞིང་མཛོད་རྣམས་ཤིན་ཏུ་མང་། །ནོར་ཡང་མང་ཞིང་རིན་ཆེན་ནོར་དང་ལྡན། །ཇི་ལྟར་ཏིང་འཛིན་རྡུལ་བྲལ་འདི་ཐོབ་ནས།
en: Have gained a wealth, a treasure of precious jewels. That is a treasure difficult to acquire. {48}

source: །བྱང་ཆུབ་སེམས་དཔའ་དགའ་ཞིང་རངས་པ་ལྟར།
en: “Someone with knowledge will never rejoice

source: །རྒྱལ་སྲིད་ཤིན་ཏུ་འབྱོར་ཅིང་རྒྱས་ཐོབ་ཀྱང་།
en: In gaining a kingdom that has vast wealth, But bodhisattvas are overjoyed and thrilled To have obtained this stainless samādhi. {49}

source: །མཁས་པ་དེ་དག་ནམ་ཡང་དགར་མི་འགྱུར།
en: “They become constant holders of

source: །དེ་དང་དེ་དག་སངས་རྒྱས་ཀུན་མཁྱེན་གྱི།
en: The Dharma of all the omniscient buddhas

source: །ཆོས་རྣམས་རྟག་ཏུ་འཛིན་པར་བྱེད་པ་ཡིན།
en: And thus they hold the supreme way of the Dharma

source: །ཟད་པའི་མཐར་ཐུག་དུས་སུ་གྱུར་པའི་ཚེ།
en: During the final age of degeneration.

source: །ཆོས་ཀྱི་ཚུལ་མཆོག་རྒྱ་ཆེར་འཛིན་པར་འགྱུར། །ཆོས་ཀྱི་མཛོད་འཆང་བློ་གྲོས་ཆེན་པོ་འཆང་།
en: They are holders of the treasure of the Dharma and great realization;

source: །ཐམས་ཅད་མཁྱེན་པའི་མཛོད་ཀྱང་འཆང་བ་ཡིན།
en: They are holders of the treasure of omniscience.

source: །དེ་དང་དེ་དག་སེམས་ཅན་བྱེ་སྟོང་དང་། །ཁྲག་ཁྲིག་ཆོས་ཀྱི་དབྱངས་ཀྱིས་མགུ་བར་བྱེད།
en: They bring happiness to quintillions Of beings through the words of the Dharma. {50}

source: །དེ་དག་ཚུལ་ཁྲིམས་ནོར་ལྡན་བློ་གྲོས་ཅན།
en: “They are people who have gained the wealth of correct conduct,

source: །སྐྱེས་བུ་དེ་དག་བསླབས་པའི་ནོར་གྱིས་ཕྱུག །དེ་དང་དེ་དག་ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་གནས།
en: Who have understanding and the wealth of the trainings. They maintain the discipline of correct conduct

source: །མངོན་དགའ་ཆོས་ཀྱི་སྡོང་པོའི་མྱུ་གུ་ཡིན།
en: And they rejoice in seedlings of the tree of the Dharma.

source: །དེ་དག་ཆོས་གོས་ངུར་སྨྲིག་རིན་ཆེན་འཆང་།
en: They are holders of the precious orange Dharma robes

source: །ཁྱིམ་ནས་འབྱུང་ལ་རྟག་ཏུ་དགའ་བར་བྱེད།
en: And they are constantly happy in homelessness.

source: །དེ་དག་སེམས་ཅན་ཕན་ཕྱིར་མཉམ་པ་མེད།
en: They are unequaled in benefiting beings

source: །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་ཞུགས།
en: And they are established in omniscience. {51}

source: །དེ་དག་དུལ་བ་སེམས་ཅན་མ་དུལ་འདུལ།
en: “They are tamed and are tamers of untamed beings.

source: །དེ་དག་དུལ་ཞིང་རབ་དུལ་རྗེས་སུ་སོང་།
en: They are tamed and follow those who are perfectly tamed.

source: །ཞི་བའི་དབང་པོ་རབ་ཏུ་ཞི་བ་ཡིན།
en: They have pacified senses—perfectly pacified.

source: །དེ་དག་སེམས་ཅན་ཉལ་བ་གཉིད་ལོག་པ། །རྟག་ཏུ་ཆོས་ཀྱི་སྐད་ཀྱིས་སད་པར་བྱེད།
en: They constantly awaken with the sound of the Dharma Those beings who are asleep, who are fast asleep,

source: །སེམས་ཅན་དག་ནི་སད་པར་བྱས་ནས་སུ།
en: And having awakened those beings they establish them

source: །རིན་ཆེན་ཆོས་བཟང་མཆོག་ལ་འགོད་པར་བྱེད།
en: In the supremely good jewel of the Dharma. {52}

source: །དེ་དང་དེ་དག་སྦྱིན་པའི་བདག་པོ་ཡིན།
en: “They become lords of generosity

source: །ཁོར་མོར་རྟག་ཏུ་གཏོང་ལ་བརྐྱང་བ་སྟེ།
en: Who are constantly giving freely.

source: །མཁས་པ་དེ་དག་འཇུངས་དང་འགྲོགས་མི་བྱེད།
en: They are wise and do not associate with the envious,

source: །གཏོང་བ་ཆེན་པོ་དག་ལ་རྟག་ཏུ་དགའ།
en: And they always rejoice in great generosity.

source: །དེ་དག་སེམས་ཅན་དབུལ་ཞིང་སྡུག་བསྔལ་རྣམས། །མཐོང་ནས་ལོངས་སྤྱོད་ཀྱིས་ཀྱང་ཚིམ་པར་བྱེད།
en: When they see poor and suffering beings They content them with possessions.

source: །དེ་དག་སེམས་ཅན་བདེ་ཞིང་ཕན་པའི་ཕྱིར། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རྟག་པར་ཞུགས།
en: They are constantly focused on omniscience In order to bring benefit and happiness to beings. {53}

source: །དེ་དག་ཡེ་ཤེས་རྟག་ཏུ་བསླབས་པ་སྟེ།
en: “They constantly train in wisdom

source: །ཆོས་ཀྱི་རྔ་ཡང་རྒྱ་ཆེར་ཤིན་ཏུ་རྡུང་།
en: And beat loudly the drum of the Dharma.

source: །སྐྱེ་བོ་ཀུན་གྱི་ཐེ་ཚོམ་འཁྲི་ཤིང་གཅོད།
en: They cut through the creepers of doubt in all beings

source: །རྟག་པར་ཡེ་ཤེས་ལ་ཡང་རབ་ཏུ་ཞུགས།
en: And are constantly engaged in wisdom.

source: །དེ་དག་ལེགས་ཐོས་ཆོས་འཛིན་རྡུལ་བྲལ་བ།
en: They are stainless, well-learned holders of the Dharma. They are wise and have understanding.

source: །འཁོར་གྱི་ནང་དུ་སྟན་ལ་འདུག་ནས་སུ། །མཁས་པ་བློ་གྲོས་འཆང་བ་དེ་དག་ནི།
en: They sit upon a seat within the assembly

source: །མདོ་སྡེ་བྱེ་བ་བརྒྱ་དག་རབ་ཏུ་སྟོན། །དེ་དང་དེ་དག་མང་དུ་ཐོས་པ་ཡིན།
en: And they teach millions of sūtras. {54}

source: །ཐོས་པ་འཛིན་པ་སངས་རྒྱས་ཆོས་རྣམས་འཛིན།
en: “They are greatly learned and hold what they have learned; They are holders of the Dharma of the buddhas.

source: །ཆོས་ཀྱི་མཛོད་རྣམས་ཤིན་ཏུ་འཛིན་བྱེད་དེ།
en: They are holders of the treasure that is the Dharma

source: །ཐུབ་པའི་ཆོས་ཀྱི་གཏེར་ལ་དགའ་བ་ཡིན།
en: And they rejoice in the treasury of the Sage.

source: །དེ་དང་དེ་དག་ཤེས་རབ་ཡངས་པ་ཡིན།
en: They have become possessors of immense wisdom

source: །དགའ་བ་དག་ཀྱང་རྒྱ་ཆེར་རྟག་ཏུ་སྐྱེད། །ཞིབ་ཅིང་འབྱུང་བར་འགྱུར་བ་བལྟ་དཀའ་བ།
en: And they are constantly giving rise to vast joy.

source: །ཞི་བའི་ཆོས་མཆོག་རྣམས་ཀྱང་རབ་ཏུ་སྟོན།
en: They teach the peace of the supreme Dharma, Which is subtle, liberating, and difficult to see. {55}

source: །དེ་དག་ཆོས་དང་ཆོས་མིན་ཤེས་པ་སྟེ།
en: “They know what is Dharma and what is not.

source: །དེས་ཤིང་བློ་གྲོས་ལྡན་པ་ཆོས་ལ་གནས།
en: They are gentle, wise, and remain within the Dharma.

source: །ཆོས་ཀྱི་རྒྱལ་སྲིད་རབ་ཏུ་སྟོན་བྱེད་ཅིང་།
en: They are unequaled teachers of the kingdom of the Dharma

source: །མཚུངས་མེད་ཆོས་ཀྱི་མཆོག་ལ་རྟག་ཏུ་སྤྱོད།
en: And constantly practice the supreme, unequaled Dharma.

source: །དེ་དག་ཆོས་ཀྱི་མཆོག་ལ་ལྷུར་བྱེད་དེ།
en: They are devoted to the excellent Dharma

source: །བླ་མ་ལ་ཡང་རི་མོ་བྱེད་པར་གནས།
en: And maintain veneration of the guru.

source: །ཆོས་ཀྱི་གྲོང་ཁྱེར་མཆོག་ལ་གནས་པ་སྟེ།
en: They dwell in the supreme city of the Dharma.

source: །བློ་གྲོས་ལྡན་པ་ཆོས་ཀྱི་རྒྱལ་མཚན་སྒྲེང་།
en: They who are wise raise up the banner of the Dharma. {56}

source: །དེ་དག་དྲེགས་ཤིང་རྒྱགས་པའི་སེམས་ཅན་རྣམས།
en: “When they see beings who are proud,

source: །རྟག་ཏུ་བག་མེད་པ་ལ་གནས་པ་མཐོང་།
en: Arrogant, and constantly heedless,

source: །རབ་ཏུ་མ་རུངས་ལོག་པའི་ལམ་སོང་ཞིང་།
en: Who are on a destructive, wrong path,

source: །འཁོར་བའི་ལམ་ལ་གནས་པ་མཐོང་ནས་ནི།
en: Who are following the path of saṃsāra,

source: །དེ་ལ་བྱམས་དང་སྙིང་རྗེ་རྒྱ་ཆེར་བསྐྱེད།
en: They have vast love and compassion for them

source: །དགའ་དང་བཏང་སྙོམས་དག་ལའང་རབ་གནས་ཏེ།
en: While remaining in joy and equanimity.

source: །དེ་དག་ལ་ནི་ཡན་ལག་བརྒྱད་ལྡན་པ།
en: They teach them the supreme eightfold path

source: །ལམ་མཆོག་ཞི་བ་བལྟ་དཀའ་རབ་ཏུ་སྟོན།
en: Of peace that is difficult to see. {57}

source: །དེ་དང་དེ་དག་ལེགས་བྱས་ཆོས་ཀྱི་གྲུ།
en: “They build the strong ship of the Dharma To save and carry the many beings

source: །བཤམས་ནས་འཁོར་བའི་རྒྱུན་ཏུ་སོང་བ་དག །རྒྱ་མཚོ་ཆེན་པོར་ལྷུང་ཞིང་ཁྱེར་བ་ཡི། །སེམས་ཅན་མང་པོ་དག་ནི་སྒྲོལ་བར་བྱེད།
en: Who have fallen into the great ocean And into the rivers of saṃsāra.

source: །བྱང་ཆུབ་ཡན་ལག་སྟོབས་དང་དབང་པོ་ཡིས།
en: Armored in the strengths, powers, and aspects of enlightenment,

source: །གོ་བགོས་དམ་པའི་ཆོས་ཀྱི་གྲུར་ཞུགས་ནས།
en: They set out upon the ship of the Dharma,

source: །ཕ་རོལ་འགྲམ་བདེ་རྟག་ཏུ་འཇིགས་མེད་པར།
en: And they always easily and without fear

source: །ཁོར་མོར་སེམས་ཅན་རྣམས་ཀྱང་འགོད་པར་བྱེད།
en: Bring beings to the far shore. {58}

source: །དེ་དག་སྨན་པའི་གཙོ་བོ་དཀའ་ཐུབ་ལ།
en: “They practice the discipline of the supreme medicine.

source: །ཤིན་ཏུ་སྤྱད་པ་རིག་བྱེད་སྨན་པའི་མཆོག །རིག་པ་ཡེ་ཤེས་རྣམ་གྲོལ་ཕ་རོལ་ཕྱིན།
en: They are physicians who possess the supreme medicine. They have perfectly attained liberation through knowledge and wisdom,

source: །དམ་པའི་ཆོས་ཀྱི་རྩི་ཡང་སྦྱིན་པར་བྱེད།
en: And they dispense the medicine of the good Dharma.

source: །ནད་ནི་རྣམ་པ་མང་པོས་བཏབ་པ་ཡི། །སེམས་ཅན་ན་བ་དག་ཀྱང་མཐོང་ནས་སུ།
en: When they see sick beings Afflicted by many illnesses,

source: །དེ་དག་ལ་ནི་ཆོས་ཀྱི་བཀྲུ་སྨན་གཏོང་།
en: They give them the medicine of the Dharma

source: །ཆོས་རྣམས་ཀྱིས་ནི་དེ་དག་གསོ་བ་བྱེད།
en: And they heal them through the Dharma. {59}

source: །དེ་དག་སྨྲ་བ་ཕ་རོལ་རྒོལ་བ་འཇོམས། །འཇིག་རྟེན་དབང་པོ་ཚིག་གི་དབང་ཕྱུག་ལྡན།
en: “They are lords of the world, sovereigns of speech, And they defeat their adversaries in debate.

source: །ཤེས་བྱ་ཀུན་ལ་འོད་བྱེད་བློ་གྲོས་འཆང་།
en: They shine with the light of omniscience.

source: །ཡེ་ཤེས་དམ་པའི་ས་ལ་རབ་ཏུ་གནས།
en: They have understanding and are on the level of the highest wisdom.

source: །དཔའ་བོ་ཡེ་ཤེས་སྟོབས་ལྡན་སྟོབས་འཇོམས་པ།
en: They are heroes with the strength of wisdom that defeats other strengths.

source: །ཡེ་ཤེས་ལྡན་པ་དག་གིས་ཡང་དག་བསྔགས།
en: They are praised by those who have wisdom.

source: །སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོ་དག །ཆོས་ལ་གནས་ནས་ཤེས་པས་མགུ་བར་བྱེད།
en: With their wisdom they bring happiness to many Trillions of beings, establishing them in the Dharma. {60}

source: །དེ་དང་དེ་དག་བདག་པོ་དེད་དཔོན་ཏེ།
en: “They are the masters, the leaders of merchant caravans,

source: །གསལ་བ་སེམས་ཅན་རྣམས་ཀྱི་སྐྱབས་འདོད་པ།
en: Who are dedicated to protecting beings from misfortune.

source: །སེམས་ཅན་རིན་ཆེན་ལམ་ལ་རྨོངས་གྱུར་ཅིང་། །རྟག་ཏུ་བདུད་ཀྱི་སྙིང་ཞུགས་མཐོང་ནས་ནི།
en: When they see beings bewildered on a path of jewels Who are constantly caught in the trap of Māra,

source: །དེ་དག་ལ་ཡང་ལམ་མཆོག་ཞི་ཞིང་བདེ། །རྟག་པར་མྱ་ངན་འདས་པ་རབ་ཏུ་སྟོན།
en: They explain to them the supreme path Of constant peace, happiness, and emancipation.

source: །མཁས་པ་དག་ནི་ཡེ་ཤེས་ལམ་དེ་ཡིས། །སེམས་ཅན་མང་པོ་བྱེ་བརྒྱ་འདྲེན་པར་བྱེད།
en: Through that path of wisdom The wise ones guide many billions of beings. {61}

source: །དེ་དང་དེ་དག་གནས་དང་རྟེན་དུ་འགྱུར།
en: “They are a sanctuary, they are a shelter,

source: །སྐྱབས་དང་མིག་དང་སྒྲོན་མ་བྱེད་པ་ཡིན།
en: They are a refuge; they are eyes and a lamp.

source: །འཇིགས་པ་རྣམས་ལ་མི་འཇིགས་རབ་ཏུ་སྦྱིན།
en: They give freedom from fear to those who are afraid.

source: །སྐྲག་པ་རྣམས་ཀྱང་རྟག་ཏུ་དབུགས་འབྱིན་བྱེད།
en: They constantly bring relief to those who are fearful.

source: །དེ་དག་སེམས་ཅན་ཤིན་ཏུ་སྡུག་བསྔལ་དང་། །དམུས་ལོང་གྱུར་པ་འདི་དག་རིག་ནས་ནི།
en: When they know of beings in great suffering, Of beings who have been completely blind from birth,

source: །ཡང་དག་ཚུལ་བསླབས་རིན་ཆེན་ཆོས་རྣམས་ཀྱིས།
en: With the precious teachings on correct training

source: །ཆོས་ཀྱི་སྣང་བ་དག་ཀྱང་བྱེད་པར་འགྱུར།
en: They shine the light of the Dharma. {62}

source: །འཇིག་རྟེན་ན་ནི་བཟོ་མཆོག་ཅི་ཡོད་པ།
en: “They are the best artisans in the world,

source: །བཟོ་བོ་བྱེད་པས་སེམས་ཅན་ཕན་འགྱུར་ཞིང་།
en: Who benefit beings with their craft.

source: །གང་གིས་སེམས་ཅན་རྟག་ཏུ་བདེར་འགྱུར་བ།
en: They always make beings happy

source: །བཟོ་ཡི་རྣམ་པ་དེ་དག་ཤིན་ཏུ་བསླབས། །སུ་དག་བྱང་ཆུབ་ཏུ་ནི་མངོན་ཞུགས་ཏེ། །བློ་གྲོས་ལྡན་ཞིང་འཇིག་རྟེན་མིག་སྦྱིན་པ།
en: Through being well trained in their craft.

source: །བསླབས་པ་རྣམས་ལ་མཆོག་གི་ཕ་རོལ་ཕྱིན། །མཁས་རབ་འཇིག་རྟེན་ན་ཡང་ངོ་མཚར་ཐོབ།
en: They have attained perfection in the supreme training And are completely skilled, with wondrous attainment in the world. They who are established in enlightenment Have realization and give sight to the world. {63} “They never cease longing to listen

source: །སངས་རྒྱས་དག་གི་ཆོས་མཆོག་ཐོས་པ་ཡིས། །མཚུངས་པ་མེད་པ་ངོམས་པར་ཡོང་མི་འགྱུར།
en: To the supreme, unequaled Dharma of the buddhas.

source: །ཚུལ་ཁྲིམས་བཟོད་དང་ཏིང་འཛིན་ཕ་རོལ་ཕྱིན།
en: They have perfected conduct, patience, and samādhi,

source: །ཟབ་མོ་ཡི་ནི་ཆོས་རྣམས་ཤིན་ཏུ་ཐོས།
en: And have heard the profound Dharma. They never cease wishing to teach

source: །དེ་དག་ཞི་བ་རིན་ཆེན་ཆོས་རྣམས་ནི། །གཞན་ལ་སྟོན་པས་ངོམས་པར་མི་འགྱུར་ཏེ།
en: The precious Dharma of peace.

source: །ཐར་བའི་ཐབས་ཀྱི་ཆར་ཡང་རབ་འབེབས་ཤིང་།
en: They send down a rain of methods for liberation,

source: །ཆོས་ཀྱིས་སྐྱེས་བུ་དག་ནི་ཚིམ་པར་བྱེད།
en: Satisfying beings with the rain of the Dharma. {64}

source: །དེ་ཡི་དྲུང་དུ་སེམས་ཅན་མང་པོ་ནི།
en: “However many beings, wise ones,

source: །ཆོས་འདོད་མཁས་པ་ཇི་སྙེད་ལྷགས་ནས་སུ།
en: Come to them for the sake of the Dharma, Thinking, ‘We will listen to the true, honest path

source: །ཆོས་མཆོག་བཟང་པོ་དམ་པ་རིན་པོ་ཆེ། །དྲང་ཞིང་གསལ་བའི་ལམ་རྣམས་མཉན་སྙམ་པ།
en: Of the supreme jewel of the excellent Dharma,’

source: །དེ་དག་བློ་གྲོས་འཆང་བས་ཐེ་ཚོམ་བཅད།
en: The realized ones cut through their doubts

source: །ཆོས་ཀྱིས་དེ་དག་ཤིན་ཏུ་མགུ་བར་བྱེད།
en: And bring them happiness through the Dharma.

source: །སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་རབ་ཏུ་ཤེས།
en: And they know the aspirations of beings. {65}

source: །ཡེ་ཤེས་ལྡན་ཞིང་ཡེ་ཤེས་མཆོག་རབ་ཀྱི།
en: “They have wisdom, the perfection of the highest wisdom,

source: །ཕ་རོལ་ཕྱིན་པ་སེམས་ཅན་བསམ་ལ་མཁས།
en: And they are wise concerning the aspirations of beings.

source: །སེམས་ཅན་ཕ་རོལ་སེམས་དང་སྤྱོད་པ་དང་། །གང་དག་གཏམ་ནི་ཅི་འདྲའི་ཆོས་བརྗོད་པ།
en: They know the motivations and conduct of other beings

source: །ཡེ་ཤེས་གཏམ་ནི་བརྗོད་ལ་གང་དག་གིས།
en: And they know what should be said to them. Through their speaking words of wisdom

source: །སེམས་ཅན་ཁྲག་ཁྲིག་ཆོས་མཆོག་མིག་ཐོབ་འགྱུར། །དེ་དག་ཡེ་ཤེས་བྱེ་བྲག་ཕ་རོལ་ཕྱིན།
en: Millions of beings attain the sight of the supreme Dharma. They have attained the perfection of the highest wisdom

source: །ལམ་རྣམས་ཀྱང་ནི་ཉེ་བར་སྟོན་པར་བྱེད།
en: And they give the teachings of the path. {66} “Even billions of māras cannot know

source: །མཁས་པ་དེ་དག་གི་ནི་སེམས་རྣམས་ཀྱང་།
en: The minds of those wise ones,

source: །བདུད་རྣམས་བྱེ་བ་སྟོང་གིས་ཡོང་མི་ཤེས།
en: Just as no one can know the path

source: །ཇི་ལྟར་ནམ་མཁའ་ལ་ནི་བྱ་སོང་བ། །དེ་ཡི་རྗེས་ནི་གང་དུའང་ཤེས་མི་ནུས།
en: That a bird has flown through the air.

source: །ཡེ་ཤེས་སྟོབས་ལྡན་དུལ་ཞིང་རབ་ཏུ་ཞི།
en: They are peaceful, tamed, tranquil, have the power of wisdom,

source: །ཞི་བ་འཕགས་པའི་ཡེ་ཤེས་དག་ལ་གནས།
en: And are established in superior wisdom.

source: །དཔའ་བོ་ཁྱུ་མཆོག་བདུད་རྣམས་ཐམས་ཅད་བཅོམ།
en: They are heroes, leaders who have destroyed Māra

source: །བྱང་ཆུབ་ཞི་བ་མངོན་པར་འཚང་ཡང་རྒྱ།
en: And realized the peace of enlightenment. {67}

source: །རྟག་ཏུ་རྫུ་འཕྲུལ་དག་གི་ཕ་རོལ་ཕྱིན།
en: “They have attained perfect miraculous powers

source: །ཞིང་ཡང་བརྒྱ་ཕྲག་མང་པོར་འགྲོ་བར་བྱེད།
en: And are always traveling to hundreds of realms.

source: །སངས་རྒྱས་མང་པོ་བྱེ་བ་ཁྲག་ཁྲིག་མཐོང་།
en: They see many quintillions of buddhas,

source: །ཇི་བཞིན་གང་གཱ་ཡི་ནི་བྱེ་མ་སྙེད།
en: As numerous as the sands of the Ganges.
